alimudena/MSP430FG479/1_msp430fg479_library_BACKUP/function_tests/01_analog_input_select_test.c
#include <msp430.h>
#include <stdio.h>
#include <stdint.h>  // Necesario para uint16_t
#include "../functions/general_functions.h"
#include "../functions/SD16_A.h"

unsigned int result;
int main(void){
    volatile unsigned int i;                  // Use volatile to prevent removal
                                            // by compiler optimization
    // stop watch dog
    stop_wd();

    //setup pin for led for toggle
  //  toggle_setup();


    ////SUT

    volatile unsigned int analog_input = 2;

    // Setup and selection of the Analog input wanted
    setup_analog_input(analog_input);
    select_analog_input(analog_input);

    ////SUT end



    FLL_CTL0 |= XCAP14PF;                     // Configure load caps TODO
    for (i = 0; i < 10000; i++);              // Delay for 32 kHz crystal to
    SD16CTL |= SD16REFON+SD16SSEL0;            // 1.2V ref, SMCLK
    SD16CCTL0 |= SD16SNGL+SD16IE ;            // Single conv, enable interrupt
    SD16INCTL0 |= SD16INTDLY_0;               // Interrupt on 4th sample  
    for (i = 0; i < 0x3600; i++);             // Delay for 1.2V ref startup

    while(1){
        SD16CCTL0 |= SD16SC;                    // SET BREAKPOINT HERE
                                            // Set bit to start conversion
    //    toggle_pin();
        enter_LPM();
    };

}


#if defined(__TI_COMPILER_VERSION__) || defined(__IAR_SYSTEMS_ICC__)
#pragma vector=SD16A_VECTOR
__interrupt void SD16ISR(void)
#elif defined(__GNUC__)A
void __attribute__ ((interrupt(SD16A_VECTOR))) SD16ISR (void)
#else
#error Compiler not supported!
#endif
{
  switch (SD16IV)
  {
  case 2:                                   // SD16MEM Overflow
    break;
  case 4:                                   // SD16MEM0 IFG
    //result = read_analog_input();                      // Save CH0 results (clears IFG)
    result = SD16MEM0;
    break;
  }

    __bic_SR_register_on_exit(LPM0_bits); 
}

